In [4]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [5]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [6]:
#Ask about this!!!!
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                     {"High School": "Figueroa", "Type": "District"},
                     {"High School": "Wilson", "Type": "Charter"},
                     {"High School": "Wright", "Type": "Charter"}]

for i in high_school_types:
     print (i['High School'] + ", " + i['Type'])

Griffin, District
Figueroa, District
Wilson, Charter
Wright, Charter

In [7]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", 
                "Shelton High School", "Hernandez High School",
                "Griffin High School","Wilson High School", 
                "Cabrera High School", "Bailey High School", 
                "Holden High School", "Pena High School", 
                "Wright High School","Rodriguez High School",
                "Johnson High School", "Ford High School", 
                "Thomas High School"]

In [8]:
# Add the Pandas dependency.
import pandas as pd

In [9]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
#school_series

#Iterate through dictionary and print each high school name
for school in school_series:
    print(school)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [10]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                     {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                     {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                     {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                     {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [11]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [12]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [13]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Add Name
schools_df["School Name"] = school_name

# Add type of school
schools_df["Type"]=type_of_school

In [14]:
# Print the DataFrame.
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [15]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [16]:
# Initialize variable into a Data Frame with dictionary as its information
# and display it
school_df = pd.DataFrame(high_schools_dict)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [17]:
#Obtain name of each column
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [18]:
#Obtain Index
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
#Obtain Values
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [20]:
#New Lists
ID=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]
    
NAME=["Huang High School",
            "Figueroa High School",
            "Shelton High School",
            "Hernandez High School",
            "Griffing High School",
            "Wilson High School",
            "Cabrera High School",
            "Bailey High School",
            "Holden High School",
            "Pena High School",
            "Wright High School",
            "Rodriguez High School",
            "Johnson High School",
             "Ford High School",
             "Thomas High School"]
    
Type=["District","District","Charter","District","Charter","Charter",
             "Charter","District","Charter","Charter","Charter","District",
             "District","District","Charter"]

In [21]:
H_S_df = pd.DataFrame()
    
H_S_df["School ID"] = ID
H_S_df["School Name"] = NAME
H_S_df["Type"] = Type

In [22]:
H_S_df

    School ID            School Name      Type
0           0      Huang High School  District
1           1   Figueroa High School  District
2           2    Shelton High School   Charter
3           3  Hernandez High School  District
4           4   Griffing High School   Charter
5           5     Wilson High School   Charter
6           6    Cabrera High School   Charter
7           7     Bailey High School  District
8           8     Holden High School   Charter
9           9       Pena High School   Charter
10         10     Wright High School   Charter
11         11  Rodriguez High School  District
12         12    Johnson High School  District
13         13       Ford High School  District
14         14     Thomas High School   Charter

In [23]:
import pandas as pd
import os

#Use:student_data = os.path.join('..','Resources','new_student_data.csv') if file not in the same folder
student_data = os.path.join('Resources','new_student_data.csv')
student_df = pd.read_csv(student_data)
student_df.head()#first 5 rows
#student_df.tail() : last 5 rows

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [24]:
student_df["student_name"]

0            Sarah Douglas
1        Francisco Osborne
2                Ryan Haas
3             Kathryn Mack
4          Harold Reynolds
               ...
13935          Kelly Myers
13936       Kimberly Burke
13937      Crystal Merritt
13938        Misty Wiggins
13939        Michele Jones
Name: student_name, Length: 13940, dtype: object

In [25]:
# .isnull() : Finds cells with NaN as a value and returns True in the cell that is found

student_df.isnull().head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,False,False,False,False,False,False,False
1,False,False,False,False,True,True,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False

In [26]:
#Returns the amount of NaN in each column
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [27]:
#Returns the mean of NaN of each column
student_df.isnull().mean()

student_id       0.000000
student_name     0.000000
grade            0.000000
school_name      0.000000
reading_score    0.101435
math_score       0.050574
school_type      0.000000
dtype: float64

In [28]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df
apple_df.isnull().sum()

AAPL    6
dtype: int64

In [29]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns

   AAPL  GOOG
0  0.50  0.45
1   NaN  0.63
2  0.62  0.55

In [30]:
# to drop NaN values
daily_returns.dropna()

   AAPL  GOOG
0  0.50  0.45
2  0.62  0.55

In [31]:
# Replace the NaNs with "Unknown"
daily_returns = daily_returns.fillna("Unknown")

# Replace the NaNs with 0
#daily_returns = daily_returns.fillna(0)

# Replace the NaNs with the mean of the column
#daily_returns = daily_returns.fillna(daily_returns.mean())

daily_returns

      AAPL  GOOG
0      0.5  0.45
1  Unknown  0.63
2     0.62  0.55

In [32]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df

# .duplicated(): finds duplicated values and returns true
best_actors_df.duplicated()

0    False
1     True
2    False
dtype: bool

In [33]:
#Counts how many duplicated values there are
best_actors_df.duplicated().sum()

1

In [34]:
#Drops duplicated values
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [35]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [36]:
prices.dtypes

price_usd    object
dtype: object

In [37]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")
prices

C:\Users\HP\AppData\Local\Temp\ipykernel_23608\2432851801.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")

  price_usd
0      0.53
1      0.22
2      0.34

In [38]:
prices.dtypes

price_usd    object
dtype: object

In [39]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")
prices.dtypes

price_usd    float64
dtype: object

In [40]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [41]:
# .describe() : displays summary statistics
sales_df.describe()

        quantity  total_price
count   5.000000     5.000000
mean   13.000000    37.688000
std     8.717798    17.128761
min     2.000000     8.460000
25%    10.000000    39.520000
50%    12.000000    40.200000
75%    15.000000    50.010000
max    26.000000    50.250000

In [42]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df

       AAPL
0   1045.85
1   1070.08
2   1140.99
3   1113.65
4   1193.32
5   1231.54
6   1215.00
7   1207.15
8   1248.84
9   1166.27
10  1138.85
11  1003.63
12  1080.91

In [43]:
goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [44]:
# returns minimum price of the column total price
min_price = sales_df["total_price"].min()
min_price

8.46

In [45]:
import pandas as pd

# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc: returns value of a row based on index number 
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [46]:
# Returns a range of values
aapl_returns.iloc[0:3]

   AAPL
0  0.50
1  0.56
2  0.59

In [47]:
import pandas as pd

aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})

aapl_returns.iloc[4:7] # Method 1

   AAPL
4  0.10
5  0.75
6  0.47

In [48]:
aapl_returns.iloc[-3:7] # Method 2: last number is not included

   AAPL
4  0.10
5  0.75
6  0.47

In [49]:
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      166
2019-09-24      229
2019-09-25      739
2019-09-26      155
2019-09-27      925

In [50]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01       32
2018-10-02      839
2018-10-03      229
2018-10-04      637
2018-10-05      797
...             ...
2019-03-27      945
2019-03-28      796
2019-03-29      467
2019-03-30      513
2019-03-31      316

[182 rows x 1 columns]

In [51]:
# Describe the data by using summary statistics
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   450.170330
std    285.390028
min      6.000000
25%    191.250000
50%    457.500000
75%    693.750000
max    993.000000

In [52]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [53]:
# Conditional to check if values in column quantity are greater than 10
sales_df['quantity']>10

0     True
1     True
2    False
3     True
4    False
Name: quantity, dtype: bool

In [54]:
#Locates values that are greater than 10 in column quantity and returns those values in a chart
filter = sales_df["quantity"] > 10
sales_df.loc[filter]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [55]:
#same thing as above
sales_df.loc[sales_df["quantity"] > 10]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [56]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})

#The following code selects the rows where the quantity is greater than ten and the total price is less than 45:
sales_df.loc[(sales_df["quantity"]>10) & (sales_df["total_price"]<45)]

       item  quantity  total_price
1    onions        26        39.52
3  tomatoes        12        40.20

In [57]:
# Returns value that meet either criteria
sales_df.loc[ (sales_df["quantity"]>10) | (sales_df["total_price"]<45) ]

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [58]:
# Returns the item that has the lowest total price:
min_price = sales_df["total_price"].min()
min_price_row = sales_df.loc[sales_df["total_price"] == min_price]
min_price_row

        item  quantity  total_price
4  mushrooms         2         8.46

In [59]:
#Return the maximum quantity:
max_quantity = sales_df["quantity"].max()
max_quantity_row = sales_df.loc[sales_df["quantity"] == max_quantity]
max_quantity_row

     item  quantity  total_price
1  onions        26        39.52

In [60]:
#Returns mean price of tomatoes:
sales_df.loc[sales_df["item"] == "tomatoes",["total_price"]].mean()

total_price    45.225
dtype: float64

In [61]:
sales_df.iloc[0:3,[0,2]]

       item  total_price
0  tomatoes        50.25
1    onions        39.52
2  potatoes        50.01

In [62]:
#To return columns without specifying rows:
sales_df.loc[:,["item","total_price"]]

        item  total_price
0   tomatoes        50.25
1     onions        39.52
2   potatoes        50.01
3   tomatoes        40.20
4  mushrooms         8.46

In [63]:
sales_df.sort_values("total_price")

        item  quantity  total_price
4  mushrooms         2         8.46
1     onions        26        39.52
3   tomatoes        12        40.20
2   potatoes        10        50.01
0   tomatoes        15        50.25

In [64]:
#Sorting in descending order
sales_df.sort_values("total_price",ascending=False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [65]:
#Sorting multiple columns by descending order. in this case it has to match both total price and item
sales_df.sort_values(["total_price","item"],ascending=False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [66]:
#Sorts in descending order for column items
sales_df.sort_values(["item"],ascending=False)

        item  quantity  total_price
0   tomatoes        15        50.25
3   tomatoes        12        40.20
2   potatoes        10        50.01
1     onions        26        39.52
4  mushrooms         2         8.46

In [67]:
sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions", "tomatoes"],
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [68]:
#groups item column
item_group_df = sales_df.groupby("item")
item_group_df

In [69]:
#returns mean of items
item_group_df.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [70]:
#returns max of store and item column
store_item_group_df = sales_df.groupby(["store", "item"])
store_item_group_df.max()

                    quantity  total_price
store    item
Downtown mushrooms         2         8.46
         onions           26        39.52
         tomatoes         15        50.25
Midtown  onions           20        30.40
         potatoes         10        50.10
         tomatoes         16        53.60